10/data/attachments/a7f81af8d6c0235.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_93ff4070-cf5c-40b5-82d5-9452476aa2ca</nif:username>
            <nif:friendToBeAdded>Sara_oil_Friend_55361_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>